hello-yan3/STM32-learning/6-USART—串口通信/1. USART1发送数据/User/usart/bsp_debug_usart.h
#ifndef __DEBUG_USART_H
#define	__DEBUG_USART_H

#include "stm32f1xx.h"
#include <stdio.h>

//串口波特率
#define DEBUG_USART_BAUDRATE                    115200

//引脚定义
/*******************************************************/
#define DEBUG_USART                             USART1
#define DEBUG_USART_CLK_ENABLE()                __HAL_RCC_USART1_CLK_ENABLE();

#define DEBUG_USART_RX_GPIO_PORT                GPIOA
#define DEBUG_USART_RX_GPIO_CLK_ENABLE()        __HAL_RCC_GPIOA_CLK_ENABLE()
#define DEBUG_USART_RX_PIN                      GPIO_PIN_10

#define DEBUG_USART_TX_GPIO_PORT                GPIOA
#define DEBUG_USART_TX_GPIO_CLK_ENABLE()        __HAL_RCC_GPIOA_CLK_ENABLE()
#define DEBUG_USART_TX_PIN                      GPIO_PIN_9

/************************************************************/

extern UART_HandleTypeDef UartHandle;

void DEBUG_USART_Config(void);

void Usart_SendByte(uint8_t ch);
void Usart_SendHalfWord(uint16_t ch);
void Usart_SendWord(uint32_t ch);
void Usart_SendArray(uint8_t *array, uint16_t num);
void Usart_SendString(char *str);

int fputc(int ch, FILE *f);
int fgetc(FILE *f);
void Serial_Printf(char *format, ...);

#endif /* __USART1_H */
